app/views/student_groups/_form.html.erb

SELECT "schools".* FROM "schools"
---
    <%= form.label :school_id, "School" %>
    <%= form.collection_select :school_id, School.all, :id, :name, { prompt: "Select a school" }, class: "block shadow rounded-md border border-gray-400 outline-none px-3 py-2 mt-2 w-full" %>