app/views/classrooms/_form.html.erb

SELECT "schools".* FROM "schools"
---
    <%= form.label :school_id %>
    <%= form.collection_select :school_id, School.all, :id, :name, { prompt: "Select a school" }, class: "block shadow rounded-md border border-gray-400 outline-none px-3 py-2 mt-2 w-full" %>

SELECT "subjects".* FROM "subjects"
---
    <%= form.label :subject_ids, "Subjects" %>
    <%= form.collection_check_boxes :subject_ids, Subject.all, :id, :name do |b| %>