app/views/users/_form.html.erb

SELECT "student_groups".* FROM "student_groups"
---
    <%= form.label :student_group_id, "Student Group" %>
    <%= form.collection_select :student_group_id, StudentGroup.all, :id, :name, { prompt: "Select a student group" }, class: "block shadow rounded-md border border-gray-400 outline-none px-3 py-2 mt-2 w-full" %>

SELECT "schools".* FROM "schools"
---
    <%= form.label :school_id, "School" %>
    <%= form.collection_select :school_id, School.all, :id, :name, { prompt: "Select a school" }, class: "block shadow rounded-md border border-gray-400 outline-none px-3 py-2 mt-2 w-full" %>