app/views/lessons/_form.html.erb

    <%= form.label :student_group_id %>
    <%= form.collection_select :student_group_id, StudentGroup.all, :id, :name, { prompt: "Select a student group" }, class: "block shadow rounded-md border border-gray-400 outline-none px-3 py-2 mt-2 w-full" %>
---
SELECT "student_groups".* FROM "student_groups"

    <%= form.label :user_id %>
    <%= form.collection_select :user_id, User.all, :id, :name, { prompt: "Select a teacher" }, class: "block shadow rounded-md border border-gray-400 outline-none px-3 py-2 mt-2 w-full" %>
---
SELECT "users".* FROM "users"

    <%= form.label :classroom_id %>
    <%= form.collection_select :classroom_id, Classroom.all, :id, :name, { prompt: "Select a classroom" }, class: "block shadow rounded-md border border-gray-400 outline-none px-3 py-2 mt-2 w-full" %>
---
SELECT "classrooms".* FROM "classrooms"

    <%= form.label :subject_id %>
    <%= form.collection_select :subject_id, Subject.all, :id, :name, { prompt: "Select a subject" }, class: "block shadow rounded-md border border-gray-400 outline-none px-3 py-2 mt-2 w-full" %>
---
SELECT "subjects".* FROM "subjects"