app/controllers/classrooms_controller.rb

  def index
    @classrooms = Classroom.all
---
SELECT "classrooms".* FROM "classrooms"

  def create
    @classroom = Classroom.new(classroom_params)

    if @classroom.save
---
INSERT INTO "classrooms" ("name", "description", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Sala 31"], ["description", "Sala 31"], ["created_at", "2024-10-02 08:19:56.170208"], ["updated_at", "2024-10-02 08:19:56.170208"], ["school_id", 1]]

  def update
    if @classroom.update(classroom_params)
---
UPDATE "classrooms" SET "name" = ?, "updated_at" = ? WHERE "classrooms"."id" = ?  [["name", "Updated Classroom"], ["updated_at", "2024-10-02 10:25:22.449759"], ["id", 1]]

  def destroy
    @classroom.destroy!
---
DELETE FROM "classrooms" WHERE "classrooms"."id" = ?  [["id", 1]]

    def set_classroom
      @classroom = Classroom.find(params[:id])
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]