app/controllers/lessons_controller.rb

  def index
    @lessons = Lesson.where("start_time < ?", Date.beginning_of_week)
---
SELECT "lessons".* FROM "lessons" WHERE (start_time < ?) AND "lessons"."start_time" BETWEEN ? AND ?  [[nil, "monday"], ["start_time", "2024-10-02 00:00:00"], ["start_time", "2024-10-02 23:59:59.999999"]]

  def create
    @lesson = Lesson.new(lesson_params)

    if @lesson.save
---
INSERT INTO "lessons" ("created_at", "updated_at", "title", "description", "start_time", "end_time", "student_group_id", "teacher_id", "classroom_id", "subject_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @lesson.update(lesson_params)
---
UPDATE "lessons" SET "updated_at" = ?, "title" = ? WHERE "lessons"."id" = ?  [["updated_at", "2024-10-02 10:38:54.599825"], ["title", "Updated Lesson"], ["id", 1]]

  def destroy
    @lesson.destroy!
---
DELETE FROM "lessons" WHERE "lessons"."id" = ?  [["id", 2]]