app/controllers/schools_controller.rb

INSERT INTO "schools" ("name", "localization", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @school = School.new(school_params)

    if @school.save

UPDATE "schools" SET "localization" = ?, "description" = ?, "updated_at" = ? WHERE "schools"."id" = ?  [["localization", "Widzew"], ["description", "To jest opis fajnej szkoły na widzewie"], ["updated_at", "2024-10-02 08:37:12.045935"], ["id", 1]]
---
  def update
    if @school.update(school_params)

DELETE FROM "schools" WHERE "schools"."id" = ?  [["id", 1]]
---
  def destroy
    @school.destroy!