app/controllers/student_groups_controller.rb

SELECT "student_groups".* FROM "student_groups"
---
  def index
    @student_groups = StudentGroup.all

INSERT INTO "student_groups" ("name", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "A1"], ["created_at", "2024-10-02 08:19:45.813754"], ["updated_at", "2024-10-02 08:19:45.813754"], ["school_id", 1]]
---
  def create
    @student_group = StudentGroup.new(student_group_params)

    if @student_group.save

UPDATE "student_groups" SET "name" = ?, "updated_at" = ? WHERE "student_groups"."id" = ?  [["name", "Updated Student Group"], ["updated_at", "2024-10-02 10:43:45.993958"], ["id", 1]]
---
  def update
    if @student_group.update(student_group_params)

DELETE FROM "student_groups" WHERE "student_groups"."id" = ?  [["id", 1]]
---
  def destroy
    @student_group.destroy!

SELECT "student_groups".* FROM "student_groups" WHERE "student_groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_student_group
      @student_group = StudentGroup.find(params[:id])