app/controllers/subjects_controller.rb

  def create
    @subject = Subject.new(subject_params)

    if @subject.save
---
INSERT INTO "subjects" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Biologia"], ["created_at", "2024-10-02 02:19:03.175227"], ["updated_at", "2024-10-02 02:19:03.175227"]]

  def update
      if @subject.update(subject_params)
---
UPDATE "subjects" SET "name" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["name", "Mechanika"], ["updated_at", "2024-10-02 02:19:12.651195"], ["id", 4]]

  def destroy
    @subject.destroy!
---
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 4]]