app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "name" = ?, "surname" = ? WHERE "users"."id" = ?  [["updated_at", "2024-10-02 10:48:18.829351"], ["name", "Updated Name"], ["surname", "Updated Surname"], ["id", 1]]